ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2040/ZuluIDE_platform.cpp
    // USB log is polled here also to make sure any log messages in fault states
    // get passed to USB.
    usb_log_poll();
}
// Install FPGA license key to RP2040 flash
// buf is pointer to hex string with 26 bytes (encoding 13 bytes)
bool install_license(char *buf)
{
    uint8_t key[256] = {0};
    for (int i = 0; i < 13; i++)
    {
        char tmp[3] = {buf[i * 2], buf[i * 2 + 1], 0};
        key[i] = strtoull(tmp, NULL, 16);
    }

    if (memcmp(key, PLATFORM_LICENSE_KEY_ADDR, 32) == 0)
    {
        logmsg("---- License key matches the one already installed");
        return true;
    }


    reclock_to_default();
    // Make a test run with the license key and wait for FPGA to validate it
    logmsg("---- Testing new license key..");
    fpga_init(true, false);
    fpga_wrcmd(FPGA_CMD_LICENSE_AUTH, key, 32);
    for (int i = 0; i < 20; i++)
    {
        usb_log_poll();
        delay(100);
    }

    // Check validation results
    uint8_t status;
    fpga_rdcmd(FPGA_CMD_LICENSE_CHECK, &status, 1);

#ifdef ENABLE_AUDIO_OUTPUT
    reclock_for_audio();
#endif

    if (status < 0x80 || status > 0x84)
    {
        logmsg("---- New license key is not valid for this device, not installing (status ", status, ")");
        return false;
    }
    else
    {
        logmsg("---- New license key accepted, writing to flash (status ", status, ")");
    }

    usb_log_poll();

    // Write to RP2040 flash
    uint32_t saved_irq = save_and_disable_interrupts();
    flash_range_erase(PLATFORM_LICENSE_KEY_OFFSET, PLATFORM_FLASH_PAGE_SIZE);
    flash_range_program(PLATFORM_LICENSE_KEY_OFFSET, key, 256);
    restore_interrupts(saved_irq);

    if (memcmp(key, PLATFORM_LICENSE_KEY_ADDR, 32) == 0)
    {
        logmsg("---- Flash write successful");
        return true;
    }
    else
    {
        logmsg("---- Flash compare failed: ", bytearray(key, 5), " vs. ", bytearray(PLATFORM_LICENSE_KEY_ADDR, 5));
        return false;
    }
}

void usb_command_handler(char *cmd)
{
    if (strncasecmp(cmd, "license ", 8) == 0)
    {
        logmsg("-- Installing new license key received from USB port");
        char *p = cmd + 8;
        while (isspace(*p)) p++;

        if (strlen(p) < 26)
        {
            logmsg("---- License key too short: ", p);
        }
        else
        {
            install_license(p);
        }
    }
}

// Poll for commands sent through the USB serial port
void usb_command_poll()
{
    static uint8_t rx_buf[64];
    static int rx_len;

    uint32_t available = Serial.available();
    if (available > 0)
    {
        available = std::min<uint32_t>(available, sizeof(rx_buf) - rx_len);
        Serial.readBytes(rx_buf + rx_len, available);
        rx_len += available;
    }

    if (rx_len > 0)
    {
        char *first = (char*)rx_buf;
        for (int i = 0; i < rx_len; i++)
        {
            if (rx_buf[i] == '\n' || rx_buf[i] == '\r')
            {
                // Got complete line
                rx_buf[i] = '\0';
                usb_command_handler(first);
                rx_len = 0;
            }
            else if (isspace(*first))
            {
                first++;
            }
        }

        if (rx_len == sizeof(rx_buf))
        {
            // Too long line, discard
            rx_len = 0;
        }
    }
}

// Poll function that is called every few milliseconds.
// Can be left empty or used for platform-specific processing.
void platform_poll(bool only_from_main)
{
    static uint32_t prev_poll_time;
    static bool license_log_done = false;
    static bool license_from_sd_done = false;
    static bool updated_controller_board = false;
    // No point polling the USB hardware more often than once per millisecond
    uint32_t time_now = millis();
    if (time_now == prev_poll_time)
    {
        return;
    }
    prev_poll_time = time_now;

    // Check if there is license file on SD card
    if (!license_from_sd_done && g_sdcard_present)
    {
        license_from_sd_done = true;

        if (SD.exists(LICENSEFILE))
        {
            char buf[26];
            FsFile f = SD.open(LICENSEFILE, O_RDONLY);
            if (f.read(buf, 26) == 26)
            {
                logmsg("-- Found license key file ", LICENSEFILE);
                install_license(buf);
            }
            f.close();
            SD.remove(LICENSEFILE);
        }
    }

    // Log FPGA license status after initial delay from boot
    if (!license_log_done && time_now >= 2000)
    {
        uint8_t response[21];
        fpga_rdcmd(FPGA_CMD_LICENSE_CHECK, response, 21);
        logmsg("FPGA license request code: ",
            bytearray((uint8_t*)&g_flash_unique_id, 8),
            bytearray(response + 1, 4),
            bytearray(response + 16, 5));

        if (response[0] == 0 || response[0] == 0xFF)
        {
            logmsg("-------------------------------------------------");
            logmsg("ERROR: FPGA license check failed with status ", response[0]);
            logmsg("       Please contact customer support and provide this log file and proof of purchase.");
            logmsg("-------------------------------------------------");
        }
        else
        {
            logmsg("FPGA license accepted with status ", response[0]);
        }

        license_log_done = true;
    }

    // update settings for the controller board the first time SD is read
    if (!updated_controller_board && g_sdcard_present && g_rotary_input.GetDeviceExists())
    {
        uint8_t ticks = ini_getl("UI", "rotary_encoder_ticks", 1, CONFIGFILE);
        g_rotary_input.SetTicks(ticks);
        updated_controller_board = true;
    }

    // Monitor supply voltage and process USB events
    adc_poll();
    usb_log_poll();
    usb_command_poll();
    if (only_from_main)
        g_I2CServerImageRequestPipe.ProcessUpdates();

#ifdef ENABLE_AUDIO_OUTPUT
    static bool update_volume = false;
    if (!update_volume && g_sdcard_present)
    {
        uint8_t max_volume = (uint8_t) ini_getl("IDE", "max_volume", 100, CONFIGFILE);
        if (max_volume > 100)
        {
            max_volume = 100;
            logmsg("The setting max_volume was set higher than 100, setting to 100 from ", (int) max_volume);
        }
        audio_set_max_volume(max_volume);
        update_volume = true;
        logmsg("Max volume set to ", (int) max_volume, "/100");
    }
    audio_poll();
#endif // ENABLE_AUDIO_OUTPUT
}

